Repository: finedk/hwl-vpn
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Settings
ru: Настройки

source: About
ru: О приложении

source: Language
ru: Язык

# alternativeProtocol
source: Alternative
ru: Альтернатива

source: Select Country
ru: Выберите страну

source: Select Country and Server
ru: Выберите страну и сервер

source: Servers
ru: Серверы

# noServersForCountry
source: No servers for this country yet.
ru: Для этой страны пока нет серверов.

# statusConnected
source: Connected
ru: Подключено

# statusDisconnected
source: Disconnected
ru: Отключено

# enableMixedInbound
source: Enable Mixed Inbound Proxy
ru: Включить Mixed Inbound прокси

# listenPort
source: Port
ru: Порт

source: DNS Provider
ru: DNS провайдер

source: Per-app proxy
ru: Прокси для приложений

# perAppProxyMode
source: Mode
ru: Режим

source: All except
ru: Все кроме

source: Only selected
ru: Только выбранные

source: Select apps
ru: Выбрать приложения

source: Account
ru: Аккаунт

source: Link Device
ru: Привязать устройство

source: Unlink Device
ru: Отвязать устройство

source: Self-Check
ru: Самопроверка

# enterCode
source: Enter your code
ru: Введите ваш код

source: Device is linked
ru: Устройство привязано

source: Device not linked
ru: Устройство не привязано

source: Checking...
ru: Проверка...

source: Unlinking...
ru: Отвязка...

# linkSuccess
source: Device linked successfully
ru: Устройство успешно привязано

# linkFailed
source: Failed to link device
ru: Не удалось привязать устройство

# unlinkSuccess
source: Device unlinked successfully
ru: Устройство успешно отвязано

# unlinkFailed
source: Failed to unlink device
ru: Не удалось отвязать устройство

# checkSuccess
source: Device is linked correctly
ru: Устройство привязано корректно

# checkFailed
source: Device is not linked or token is invalid
ru: Устройство не привязано или токен недействителен

source: Server Address
ru: Адрес сервера

# enterServerAddress
source: Enter server address (URL or IP:Port)
ru: Введите адрес сервера (URL или IP:Port)

source: Reset Values
ru: Сбросить значения

# resetWarningTitle
source: Reset values?
ru: Сбросить значения?

# resetWarningContent
source: This will unlink your device and generate a new identity. This action cannot be undone.
ru: Это отвяжет ваше устройство и создаст новый идентификатор. Это действие необратимо.

source: Cancel
ru: Отмена

source: Reset
ru: Сбросить

# resetSuccess
source: Values have been reset.
ru: Значения были сброшены.

source: Device Name (Optional)
ru: Название устройства (необязательно)

# selectServerFirst
source: Please select a server first.
ru: Пожалуйста, сначала выберите сервер.

# connectingStatus
source: Connecting...
ru: Подключение...

# vpnKeyReceivedTitle
source: VPN Key Received
ru: VPN ключ получен

# failedToGetKey
source: Failed to get VPN key.
ru: Не удалось получить ключ VPN.

# servicesOnline
source: All services are online
ru: Все сервисы онлайн

# servicesOffline
source: Services are temporarily unavailable
ru: Сервисы временно недоступны

# welcomeMessage
source: Welcome to HWL VPN
ru: Добро пожаловать в HWL VPN

# onboardingDescription
source: Log in to access all features, or continue as a guest.
ru: Авторизуйтесь, чтобы получить доступ ко всем функциям, или продолжите как гость.

# authorize
source: Log In
ru: Войти

source: Continue as Guest
ru: Продолжить как гость

# continueButton
source: Continue
ru: Продолжить

# unlinkDeviceWarningTitle
source: Unlink device?
ru: Отвязать устройство?

# unlinkDeviceWarningContent
source: This action will unlink your device. Are you sure?
ru: Это действие отвяжет ваше устройство. Вы уверены?

source: Change Device Name
ru: Изменить имя устройства

source: Save
ru: Сохранить

source: Reset Settings
ru: Сбросить настройки

# resetSettingsWarningTitle
source: Reset settings?
ru: Сбросить настройки?

# resetSettingsWarningContent
source: This will reset all application settings to their default values. This action cannot be undone.
ru: Это сбросит все настройки приложения к значениям по умолчанию. Это действие необратимо.

# guestModeActive
source: You are currently in guest mode
ru: Сейчас вы в режиме гостя

# updateFailed
source: Failed to update
ru: Ошибка при обновлении

source: Persistent Notification
ru: Постоянное уведомление

source: Enable Memory Limit
ru: Включить лимит памяти

source: Not recommended
ru: Не рекомендуется

# enableMemoryLimitWarningTitle
source: Enable Memory Limit?
ru: Включить лимит памяти?

# enableMemoryLimitWarningContent
source: Enabling the memory limit can cause VPN instability and is generally not recommended. Proceed?
ru: Включение лимита памяти может вызвать нестабильность VPN и в целом не рекомендуется. Продолжить?

source: Enable
ru: Включить

source: Show System Apps
ru: Показывать системные приложения

# couldNotVerifyStatus
source: Could not verify status, check network connection.
ru: Не удалось проверить статус, проверьте подключение к сети.

# checkFailedCouldNotConnect
source: Check failed: Could not connect to server.
ru: Ошибка проверки: не удалось подключиться к серверу.

# pingNA
source: N/A
ru: Н/Д

# freeTag
source: Free
ru: Бесплатно

# mixedInboundDescription
source: Enables a local proxy server that can accept both HTTP and SOCKS5 connections on a single port. This allows other devices on your local network to use the VPN connection through this device (e.g., in tethering mode), provided you configure them to use this device as a proxy.
ru: Включает локальный прокси-сервер, который может принимать соединения HTTP и SOCKS5 на одном порту. Это позволяет другим устройствам в вашей локальной сети использовать VPN-соединение через это устройство (например, в режиме модема), при условии, что вы настроите их на использование этого устройства в качестве прокси.

# perAppProxyDescription
source: Allows you to select which apps should use the VPN connection. You can either include only selected apps or exclude selected apps.
ru: Позволяет выбрать, какие приложения должны использовать VPN-соединение. Вы можете либо включить только выбранные приложения, либо исключить выбранные приложения.

source: Hide Console Window
ru: Скрыть окно консоли

# hideConsoleWindowDescription
source: For sing-box process on Windows
ru: Для процесса sing-box в Windows

source: Excluded Domains
ru: Исключенные домены

# excludedDomainsDescription
source: Comma-separated list of domains to exclude from VPN.
ru: Список доменов через запятую для исключения из VPN.

source: Excluded Domain Suffixes
ru: Исключенные суффиксы доменов

# excludedDomainSuffixesDescription
source: Domain suffixes to exclude from VPN, e.g., .local, .lan
ru: Суффиксы доменов для исключения из VPN, например: .local, .lan

# closeBehavior
source: Close Button Behavior
ru: Поведение кнопки закрытия

source: Minimize to Tray
ru: Сворачивать в трей

# exitOnClose
source: Exit Application
ru: Закрывать приложение

source: Show
ru: Показать

source: Exit
ru: Выход

source: Enable Logging
ru: Вести логи

# enableLoggingWarningTitle
source: Enable Logging?
ru: Включить логирование?

# enableLoggingWarningContent
source: Enabling logging can consume disk space and slightly reduce performance. This feature is primarily for developers or for troubleshooting issues with technical support. Are you sure you want to enable it?
ru: Включение логирования может занимать место на диске и незначительно снижать производительность. Эта функция предназначена в основном для разработчиков или для устранения проблем со службой технической поддержки. Вы уверены, что хотите включить его?

source: Show Logs
ru: Показать логи

# logsTitle
source: Logs
ru: Логи

# clearLogsTooltip
source: Clear logs
ru: Очистить логи

# noLogsToShow
source: No logs to display.
ru: Нет логов для отображения.

source: Launch on Startup
ru: Запускать при входе в систему

# faqTelegramChannel
source: Telegram Channel
ru: Telegram канал

# faqTelegramChannelLink
source: https://t.me/hwlab_official_en
ru: https://t.me/hwlab_official

# faqWebsite
source: Our Website
ru: Наш сайт

# faqSupportEmail
source: Support Email
ru: Почта поддержки

# faqQ6
source: What to do if there are errors during application operation?
ru: Что делать, если возникают ошибки при работе приложения?

# faqA6
source: If you encounter persistent issues, try resetting the application values. This will unlink your device and generate a new identity, effectively resetting the app to its initial state. This action is irreversible and can be found in the Settings screen under 'Reset Values'.
ru: Если вы сталкиваетесь с постоянными проблемами, попробуйте сбросить значения приложения. Это отвяжет ваше устройство и создаст новый идентификатор, по сути, сбросив приложение к исходному состоянию. Это действие необратимо и находится на экране 'Настройки' под кнопкой 'Сбросить значения'.

source: Privacy Policy
ru: Политика конфиденциальности

source: Terms of Use
ru: Пользовательское соглашение

# iAccept
source: I accept the
ru: Я принимаю

source: and
ru: и

# youMustAccept
source: You must accept the terms to continue
ru: Вы должны принять условия, чтобы продолжить

# personalKeysExplanationHysteria2
source: • Hysteria 2 (hysteria2://password@host:port?params...)
ru: • Hysteria 2 (hysteria2://пароль@хост:порт?параметры...)

source: Legal
ru: Правовая информация

# updateTermsMessage
source: Please review and accept our updated terms to continue.
ru: Пожалуйста, ознакомьтесь и примите наши обновленные условия, чтобы продолжить.

# subscriptionExpired
source: Subscription expired. Only free servers are available.
ru: Подписка истекла. Доступны только бесплатные серверы.

# renewSubscription
source: Renew
ru: Продлить

source: Personal Keys
ru: Персональные ключи

# personalKeysEnterLink
source: Enter connection link - vless://4721231d-aae1-...
ru: Введите ссылку для подключения - vless://4721231d-aae1-...

# personalKeysClear
source: Clear
ru: Очистить

# personalKeysWarningTitle
source: Warning:
ru: Внимание:

# personalKeysWarningBody
source: This section is for experienced users only.
ru: Этот раздел предназначен только для опытных пользователей.

# personalKeysExplanation1
source: You can paste and use your own key here.
ru: Сюда вы можете вставить и использовать собственный ключ.

# personalKeysExplanation2
source: Supported configurations:
ru: Поддерживаемые конфигурации:

# personalKeysExplanationVless
source: • vless (TCP) + reality (vless without reality doesn't work)
ru: • vless (TCP) + reality (vless без reality не работает)

# personalKeysExplanationSsh
source: • ssh format user:private_key@ip:port (Private key must be Base64 encoded)
ru: • ssh формат user:private_key@ip:port (Приватный ключ дожен быть закодирован в Base64)

# personalKeysExplanation3
source: After pasting the key, return to the main screen and press the connect button. If the key field is filled, the app will use it, ignoring the server selected from the list. Important: use your key only if you understand VPN configurations and have one.
ru: После вставки ключа вернитесь на главный экран и нажмите кнопку подключения. Если поле с ключом заполнено, приложение будет использовать его, игнорируя сервер, выбранный из списка. Важно: используйте свой ключ только если вы разбираетесь в VPN-конфигурациях и он у вас есть.

# faqAndContacts
source: FAQ & Tech Support
ru: FAQ и Техподдержка

# faqSupport
source: Tech Support
ru: Техподдержка

# faqBot
source: Our Bot
ru: Наш бот

# faqTitle
source: Frequently Asked Questions
ru: Часто задаваемые вопросы

# faqQ1
source: What is a 'Personal Key'?
ru: Что такое 'Персональный ключ'?

# faqA1
source: This is a feature that allows you to use your own configuration key (link) to connect, instead of selecting a server from the general list. This provides more flexibility and control over your VPN connection.
ru: Это функция, позволяющая использовать для подключения собственный ключ конфигурации (ссылку), вместо выбора сервера из общего списка. Это дает больше гибкости и контроля над вашим VPN-соединением.

# faqQ2
source: Which protocol should I choose?
ru: Какой протокол выбрать?

# faqA2
source: VLESS is the preferred option for most users. Hysteria 2 provides better speeds on poor networks but might be less stable. Use 'Alternative' (SSH) if others don't work.
ru: VLESS — предпочтительный вариант для большинства. Hysteria 2 обеспечивает лучшую скорость в плохих сетях, но может быть менее стабильным. Используйте 'Альтернативу' (SSH), если остальные не работают.

# faqQ3
source: Why is my connection speed slow?
ru: Почему у меня низкая скорость?

# faqA3
source: Speed depends on many factors: server load, distance to it, the quality of your internet connection, and your provider's restrictions. Try choosing a different server or connecting at a different time.
ru: Скорость зависит от многих факторов: загруженность сервера, расстояние до него, качество вашего интернет-соединения и ограничения вашего провайдера. Попробуйте выбрать другой сервер или подключиться в другое время.

# faqQ4
source: The app won't connect, what should I do?
ru: Приложение не подключается, что делать?

# faqA4
source: 1. Check your internet connection. 2. Make sure you have selected a server. 3. Try a different server or protocol. 4. If you are using a personal key, ensure it is correct and active. 5. Contact our tech support.
ru: 1. Проверьте интернет-соединение. 2. Убедитесь, что вы выбрали сервер. 3. Попробуйте другой сервер или протокол. 4. Если вы используете персональный ключ, убедитесь, что он корректен и активен. 5. Свяжитесь с нашей техподдержкой.

# faqQ5
source: How to check connection to servers?
ru: Как проверить соединение с серверами?

# faqA5
source: On the main screen, pull down to refresh the list of available servers.
ru: На главном экране потяните экран вниз, чтобы обновить список доступных серверов.

# mixedInboundIpWarning
source: Your device IP is currently unavailable. Using 0.0.0.0. Some features might not work as expected.
ru: IP-адрес вашего устройства в настоящее время недоступен. Используется 0.0.0.0. Некоторые функции могут работать некорректно.

# mixedInboundIpUnavailable
source: Device IP Unavailable
ru: IP-адрес устройства недоступен

# mixedInboundIosMacWarning
source: On iOS & macOS, this may not work in hotspot mode.
ru: На iOS и macOS это может не работать в режиме точки доступа.

# offlineMode
source: Autonomous Mode
ru: Автономный режим

# offlineModeDescription
source: Disables server connection and API requirements. Use only with Personal Keys.
ru: Отключает соединение с сервером и требования API. Использовать только с Персональными ключами.

# offlineModeWarningTitle
source: Enable Autonomous Mode?
ru: Включить автономный режим?

# offlineModeWarningContent
source: This will disable access to public servers and account features. You will need a Personal Key to connect. Proceed?
ru: Это отключит доступ к публичным серверам и функциям аккаунта. Для подключения вам понадобится Персональный ключ. Продолжить?
